La-guajolota/PSOC-5lp/Control_delocidad_direccion_motorDC_180V/Control_delocidad_direccion_motorDC_180V.cydsn/codegentemp/Control_manual.h
/*******************************************************************************
* File Name: Control_manual.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_Control_manual_H) /* CY_STATUS_REG_Control_manual_H */
#define CY_STATUS_REG_Control_manual_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} Control_manual_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 Control_manual_Read(void) ;
void Control_manual_InterruptEnable(void) ;
void Control_manual_InterruptDisable(void) ;
void Control_manual_WriteMask(uint8 mask) ;
uint8 Control_manual_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define Control_manual_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define Control_manual_INPUTS              5


/***************************************
*             Registers
***************************************/

/* Status Register */
#define Control_manual_Status             (* (reg8 *) Control_manual_sts_intr_sts_reg__STATUS_REG )
#define Control_manual_Status_PTR         (  (reg8 *) Control_manual_sts_intr_sts_reg__STATUS_REG )
#define Control_manual_Status_Mask        (* (reg8 *) Control_manual_sts_intr_sts_reg__MASK_REG )
#define Control_manual_Status_Aux_Ctrl    (* (reg8 *) Control_manual_sts_intr_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_Control_manual_H */


/* [] END OF FILE */
